spec/cassettes/Create_payment_on_successful_charge/creates_a_payment_with_the_webhook_from_strip_for_charge_succeeded.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_16UywdJMMPtxD6Bk5YQRXzoZ
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.22.0
      Authorization:
      - Bearer sk_test_C46QzPKRDrVoMVA8U2hfSOgN
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.1.5 p273 (2014-11-13)","platform":"x86_64-darwin14.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Vikrams-MacBook-Pro.local 14.4.0 Darwin Kernel Version 14.4.0: Thu May 28
        11:35:04 PDT 2015; root:xnu-2782.30.5~1/RELEASE_X86_64 x86_64","hostname":"Vikrams-MacBook-Pro.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 03 Aug 2015 16:54:49 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1982'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6jEggfKpUSozdT
      Stripe-Version:
      - '2015-06-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_16UywdJMMPtxD6Bk5YQRXzoZ",
          "created": 1438431511,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_16UywdJMMPtxD6BkcSXVtXWy",
              "object": "charge",
              "created": 1438431511,
              "livemode": false,
              "paid": true,
              "status": "succeeded",
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "source": {
                "id": "card_16UywbJMMPtxD6BkOuGkT5Mh",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 8,
                "exp_year": 2017,
                "fingerprint": "hJysv92qq5QPJd8O",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "tokenization_method": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6iPm39kSt2FJpp"
              },
              "captured": true,
              "balance_transaction": "txn_16UywdJMMPtxD6Bkz6Spz3jL",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_6iPm39kSt2FJpp",
              "invoice": "in_16UywdJMMPtxD6BkyfSEgcqv",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_descriptor": "MyFlix",
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "destination": null,
              "application_fee": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_16UywdJMMPtxD6BkcSXVtXWy/refunds",
                "data": []
              }
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "req_6iPm4AlxtvmBmb",
          "api_version": "2015-06-15"
        }
    http_version: 
  recorded_at: Mon, 03 Aug 2015 16:54:53 GMT
recorded_with: VCR 2.9.3
